
a.out:     file format elf64-x86-64


Disassembly of section .init:

0000000000001000 <_init>:
    1000:	48 83 ec 08          	sub    $0x8,%rsp
    1004:	48 8b 05 c5 2f 00 00 	mov    0x2fc5(%rip),%rax        # 3fd0 <__gmon_start__@Base>
    100b:	48 85 c0             	test   %rax,%rax
    100e:	74 02                	je     1012 <_init+0x12>
    1010:	ff d0                	call   *%rax
    1012:	48 83 c4 08          	add    $0x8,%rsp
    1016:	c3                   	ret

Disassembly of section .plt:

0000000000001020 <free@plt-0x10>:
    1020:	ff 35 ca 2f 00 00    	push   0x2fca(%rip)        # 3ff0 <_GLOBAL_OFFSET_TABLE_+0x8>
    1026:	ff 25 cc 2f 00 00    	jmp    *0x2fcc(%rip)        # 3ff8 <_GLOBAL_OFFSET_TABLE_+0x10>
    102c:	0f 1f 40 00          	nopl   0x0(%rax)

0000000000001030 <free@plt>:
    1030:	ff 25 ca 2f 00 00    	jmp    *0x2fca(%rip)        # 4000 <free@GLIBC_2.2.5>
    1036:	68 00 00 00 00       	push   $0x0
    103b:	e9 e0 ff ff ff       	jmp    1020 <_init+0x20>

0000000000001040 <strlen@plt>:
    1040:	ff 25 c2 2f 00 00    	jmp    *0x2fc2(%rip)        # 4008 <strlen@GLIBC_2.2.5>
    1046:	68 01 00 00 00       	push   $0x1
    104b:	e9 d0 ff ff ff       	jmp    1020 <_init+0x20>

0000000000001050 <printf@plt>:
    1050:	ff 25 ba 2f 00 00    	jmp    *0x2fba(%rip)        # 4010 <printf@GLIBC_2.2.5>
    1056:	68 02 00 00 00       	push   $0x2
    105b:	e9 c0 ff ff ff       	jmp    1020 <_init+0x20>

0000000000001060 <memcpy@plt>:

  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 000000000000190a
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc2: 369 to 0000000000001a7b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop

00000188 000000000000001c 0000015c FDE cie=00000030 pc=0000000000001a7c..0000000000001b3e
  DW_CFA_advance_loc: 1 to 0000000000001a7d
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000001a80
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc1: 189 to 0000000000001b3d
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop

000001a8 000000000000001c 0000017c FDE cie=00000030 pc=0000000000001b3e..0000000000001b96
  DW_CFA_advance_loc: 1 to 0000000000001b3f
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000001b42
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc1: 83 to 0000000000001b95
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop

000001c8 000000000000001c 0000019c FDE cie=00000030 pc=0000000000001b96..0000000000001bdd
  DW_CFA_advance_loc: 1 to 0000000000001b97
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000001b9a
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc1: 66 to 0000000000001bdc
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop

000001e8 ZERO terminator


Contents of the .debug_aranges section (loaded from a.out):

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000001189 0000000000000a54
    0000000000000000 0000000000000000

Contents of the .debug_info section (loaded from a.out):

  Compilation Unit @ offset 0:
   Length:        0x6b7 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  8
 <0><c>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x6b): GNU C17 12.2.0 -mtune=generic -march=x86-64 -g -fasynchronous-unwind-tables
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect line string, offset: 0): calc3.c
    <16>   DW_AT_comp_dir    : (indirect line string, offset: 0x8): /home/laz/Documents/Personal_Work/C/calculator
    <1a>   DW_AT_low_pc      : 0x1189
    <22>   DW_AT_high_pc     : 0xa54
    <2a>   DW_AT_stmt_list   : 0
 <1><2e>: Abbrev Number: 15 (DW_TAG_typedef)
    <2f>   DW_AT_name        : (indirect string, offset: 0xb): size_t
    <33>   DW_AT_decl_file   : 5
    <34>   DW_AT_decl_line   : 214
    <35>   DW_AT_decl_column : 23
    <36>   DW_AT_type        : <0x3a>
 <1><3a>: Abbrev Number: 4 (DW_TAG_base_type)
    <3b>   DW_AT_byte_size   : 8
    <3c>   DW_AT_encoding    : 7	(unsigned)
    <3d>   DW_AT_name        : (indirect string, offset: 0x100): long unsigned int
 <1><41>: Abbrev Number: 16 (DW_TAG_base_type)
    <42>   DW_AT_byte_size   : 4
    <43>   DW_AT_encoding    : 5	(signed)
    <44>   DW_AT_name        : int
 <1><48>: Abbrev Number: 4 (DW_TAG_base_type)
    <49>   DW_AT_byte_size   : 8
    <4a>   DW_AT_encoding    : 5	(signed)
    <4b>   DW_AT_name        : (indirect string, offset: 0x133): long int
 <1><4f>: Abbrev Number: 4 (DW_TAG_base_type)
    <50>   DW_AT_byte_size   : 8
    <51>   DW_AT_encoding    : 5	(signed)
    <52>   DW_AT_name        : (indirect string, offset: 0x12e): long long int
 <1><56>: Abbrev Number: 4 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 1
    <58>   DW_AT_encoding    : 8	(unsigned char)
    <59>   DW_AT_name        : (indirect string, offset: 0xb7): unsigned char
 <1><5d>: Abbrev Number: 4 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 2
    <5f>   DW_AT_encoding    : 7	(unsigned)
    <60>   DW_AT_name        : (indirect string, offset: 0x50): short unsigned int
 <1><64>: Abbrev Number: 4 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 7	(unsigned)
    <67>   DW_AT_name        : (indirect string, offset: 0x105): unsigned int
 <1><6b>: Abbrev Number: 4 (DW_TAG_base_type)
    <6c>   DW_AT_byte_size   : 1
    <6d>   DW_AT_encoding    : 6	(signed char)
    <6e>   DW_AT_name        : (indirect string, offset: 0xb9): signed char
 <1><72>: Abbrev Number: 4 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 2
    <74>   DW_AT_encoding    : 5	(signed)
    <75>   DW_AT_name        : (indirect string, offset: 0x173): short int
 <1><79>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <7a>   DW_AT_byte_size   : 8
 <1><7b>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <7c>   DW_AT_byte_size   : 8
    <7c>   DW_AT_type        : <0x80>
 <1><80>: Abbrev Number: 4 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 1
    <82>   DW_AT_encoding    : 6	(signed char)
    <83>   DW_AT_name        : (indirect string, offset: 0xc0): char
 <1><87>: Abbrev Number: 18 (DW_TAG_const_type)
    <88>   DW_AT_type        : <0x80>
 <1><8c>: Abbrev Number: 4 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 8
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0xfb): long long unsigned int
 <1><93>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <94>   DW_AT_byte_size   : 8
    <94>   DW_AT_type        : <0x98>
 <1><98>: Abbrev Number: 19 (DW_TAG_const_type)
 <1><99>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <9a>   DW_AT_byte_size   : 8
    <9a>   DW_AT_type        : <0x87>
 <1><9e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <9f>   DW_AT_name        : (indirect string, offset: 0xf4): Number
    <a3>   DW_AT_byte_size   : 16
    <a4>   DW_AT_decl_file   : 1
    <a4>   DW_AT_decl_line   : 13
    <a5>   DW_AT_decl_column : 8
    <a5>   DW_AT_sibling     : <0xc2>
 <2><a9>: Abbrev Number: 1 (DW_TAG_member)
    <aa>   DW_AT_name        : (indirect string, offset: 0x63): content
    <ae>   DW_AT_decl_file   : 1
    <ae>   DW_AT_decl_line   : 14
    <af>   DW_AT_decl_column : 7
    <b0>   DW_AT_type        : <0x80>
    <b4>   DW_AT_data_member_location: 0
 <2><b5>: Abbrev Number: 1 (DW_TAG_member)
    <b6>   DW_AT_name        : (indirect string, offset: 0x119): after
    <ba>   DW_AT_decl_file   : 1
    <ba>   DW_AT_decl_line   : 15
    <bb>   DW_AT_decl_column : 8
    <bc>   DW_AT_type        : <0x7b>
    <c0>   DW_AT_data_member_location: 8
 <2><c1>: Abbrev Number: 0
 <1><c2>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c3>   DW_AT_name        : (indirect string, offset: 0x2b): Modifier
    <c7>   DW_AT_byte_size   : 16
    <c8>   DW_AT_decl_file   : 1
    <c8>   DW_AT_decl_line   : 18
    <c9>   DW_AT_decl_column : 8
    <c9>   DW_AT_sibling     : <0xe6>
 <2><cd>: Abbrev Number: 1 (DW_TAG_member)
    <ce>   DW_AT_name        : (indirect string, offset: 0x63): content
    <d2>   DW_AT_decl_file   : 1
    <d2>   DW_AT_decl_line   : 19
    <d3>   DW_AT_decl_column : 7
    <d4>   DW_AT_type        : <0x80>
    <d8>   DW_AT_data_member_location: 0
 <2><d9>: Abbrev Number: 1 (DW_TAG_member)
    <da>   DW_AT_name        : (indirect string, offset: 0x119): after
    <de>   DW_AT_decl_file   : 1
    <de>   DW_AT_decl_line   : 20
    <df>   DW_AT_decl_column : 8
    <e0>   DW_AT_type        : <0x7b>
    <e4>   DW_AT_data_member_location: 8
 <2><e5>: Abbrev Number: 0
 <1><e6>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e7>   DW_AT_name        : (indirect string, offset: 0xd4): Expression
    <eb>   DW_AT_byte_size   : 24
    <ec>   DW_AT_decl_file   : 1
    <ec>   DW_AT_decl_line   : 23
    <ed>   DW_AT_decl_column : 8
    <ed>   DW_AT_sibling     : <0x116>
 <2><f1>: Abbrev Number: 1 (DW_TAG_member)
    <f2>   DW_AT_name        : (indirect string, offset: 0x18f): term
    <f6>   DW_AT_decl_file   : 1
    <f6>   DW_AT_decl_line   : 24
    <f7>   DW_AT_decl_column : 15
    <f8>   DW_AT_type        : <0x146>
    <fc>   DW_AT_data_member_location: 0
 <2><fd>: Abbrev Number: 1 (DW_TAG_member)
    <fe>   DW_AT_name        : (indirect string, offset: 0x12): next
    <102>   DW_AT_decl_file   : 1
    <102>   DW_AT_decl_line   : 25
    <103>   DW_AT_decl_column : 21
    <104>   DW_AT_type        : <0x14b>
    <108>   DW_AT_data_member_location: 8
 <2><109>: Abbrev Number: 1 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x119): after
    <10e>   DW_AT_decl_file   : 1
    <10e>   DW_AT_decl_line   : 26
    <10f>   DW_AT_decl_column : 8
    <110>   DW_AT_type        : <0x7b>
    <114>   DW_AT_data_member_location: 16
 <2><115>: Abbrev Number: 0
 <1><116>: Abbrev Number: 9 (DW_TAG_structure_type)
    <117>   DW_AT_name        : (indirect string, offset: 0x45): Term
    <11b>   DW_AT_byte_size   : 24
    <11c>   DW_AT_decl_file   : 1
    <11c>   DW_AT_decl_line   : 39
    <11d>   DW_AT_decl_column : 8
    <11d>   DW_AT_sibling     : <0x146>
 <2><121>: Abbrev Number: 1 (DW_TAG_member)
    <122>   DW_AT_name        : (indirect string, offset: 0x17): item
    <126>   DW_AT_decl_file   : 1
    <126>   DW_AT_decl_line   : 40
    <127>   DW_AT_decl_column : 15
    <128>   DW_AT_type        : <0x198>
    <12c>   DW_AT_data_member_location: 0
 <2><12d>: Abbrev Number: 1 (DW_TAG_member)
    <12e>   DW_AT_name        : (indirect string, offset: 0x4a): group
    <132>   DW_AT_decl_file   : 1
    <132>   DW_AT_decl_line   : 41
    <133>   DW_AT_decl_column : 16
    <134>   DW_AT_type        : <0x19d>
    <138>   DW_AT_data_member_location: 8
 <2><139>: Abbrev Number: 1 (DW_TAG_member)
    <13a>   DW_AT_name        : (indirect string, offset: 0x119): after
    <13e>   DW_AT_decl_file   : 1
    <13e>   DW_AT_decl_line   : 42
    <13f>   DW_AT_decl_column : 8
    <140>   DW_AT_type        : <0x7b>
    <144>   DW_AT_data_member_location: 16
 <2><145>: Abbrev Number: 0
 <1><146>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <147>   DW_AT_byte_size   : 8
    <147>   DW_AT_type        : <0x116>
 <1><14b>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <14c>   DW_AT_byte_size   : 8
    <14c>   DW_AT_type        : <0xe6>
 <1><150>: Abbrev Number: 9 (DW_TAG_structure_type)
    <151>   DW_AT_name        : (indirect string, offset: 0xdf): Group
    <155>   DW_AT_byte_size   : 16
    <156>   DW_AT_decl_file   : 1
    <156>   DW_AT_decl_line   : 29
    <157>   DW_AT_decl_column : 8
    <157>   DW_AT_sibling     : <0x174>
 <2><15b>: Abbrev Number: 1 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0x63): content
    <160>   DW_AT_decl_file   : 1
    <160>   DW_AT_decl_line   : 30
    <161>   DW_AT_decl_column : 21
    <162>   DW_AT_type        : <0x14b>
    <166>   DW_AT_data_member_location: 0
 <2><167>: Abbrev Number: 1 (DW_TAG_member)
    <168>   DW_AT_name        : (indirect string, offset: 0x119): after
    <16c>   DW_AT_decl_file   : 1
    <16c>   DW_AT_decl_line   : 31
    <16d>   DW_AT_decl_column : 8
    <16e>   DW_AT_type        : <0x7b>
    <172>   DW_AT_data_member_location: 8
 <2><173>: Abbrev Number: 0
 <1><174>: Abbrev Number: 9 (DW_TAG_structure_type)
    <175>   DW_AT_name        : (indirect string, offset: 0x34): Item
    <179>   DW_AT_byte_size   : 16
    <17a>   DW_AT_decl_file   : 1
    <17a>   DW_AT_decl_line   : 34
    <17b>   DW_AT_decl_column : 8
    <17b>   DW_AT_sibling     : <0x198>
 <2><17f>: Abbrev Number: 1 (DW_TAG_member)
    <180>   DW_AT_name        : (indirect string, offset: 0x63): content
    <184>   DW_AT_decl_file   : 1
    <184>   DW_AT_decl_line   : 35
    <185>   DW_AT_decl_column : 7
    <186>   DW_AT_type        : <0x80>
    <18a>   DW_AT_data_member_location: 0
 <2><18b>: Abbrev Number: 1 (DW_TAG_member)
    <18c>   DW_AT_name        : (indirect string, offset: 0x119): after
    <190>   DW_AT_decl_file   : 1
    <190>   DW_AT_decl_line   : 36
    <191>   DW_AT_decl_column : 8
    <192>   DW_AT_type        : <0x7b>
    <196>   DW_AT_data_member_location: 8
 <2><197>: Abbrev Number: 0
 <1><198>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <199>   DW_AT_byte_size   : 8
    <199>   DW_AT_type        : <0x174>
 <1><19d>: Abbrev Number: 2 (DW_TAG_pointer_type)
    <19e>   DW_AT_byte_size   : 8
    <19e>   DW_AT_type        : <0x150>
 <1><1a2>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1a3>   DW_AT_name        : (indirect string, offset: 0xc5): Start
    <1a7>   DW_AT_byte_size   : 8
    <1a8>   DW_AT_decl_file   : 1
    <1a8>   DW_AT_decl_line   : 45
    <1a9>   DW_AT_decl_column : 8
    <1a9>   DW_AT_sibling     : <0x1ba>
 <2><1ad>: Abbrev Number: 1 (DW_TAG_member)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x63): content
    <1b2>   DW_AT_decl_file   : 1
    <1b2>   DW_AT_decl_line   : 46
    <1b3>   DW_AT_decl_column : 21
    <1b4>   DW_AT_type        : <0x14b>
    <1b8>   DW_AT_data_member_location: 0
 <2><1b9>: Abbrev Number: 0
 <1><1ba>: Abbrev Number: 20 (DW_TAG_subprogram)
    <1bb>   DW_AT_external    : 1
    <1bb>   DW_AT_name        : (indirect string, offset: 0x129): free
    <1bf>   DW_AT_decl_file   : 3
    <1c0>   DW_AT_decl_line   : 568
    <1c2>   DW_AT_decl_column : 13
    <1c3>   DW_AT_prototyped  : 1
    <1c3>   DW_AT_declaration : 1
    <1c3>   DW_AT_sibling     : <0x1cd>
 <2><1c7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1c8>   DW_AT_type        : <0x79>
 <2><1cc>: Abbrev Number: 0
 <1><1cd>: Abbrev Number: 21 (DW_TAG_subprogram)
    <1ce>   DW_AT_external    : 1
    <1ce>   DW_AT_name        : (indirect string, offset: 0x149): memcpy
    <1d2>   DW_AT_decl_file   : 2
    <1d3>   DW_AT_decl_line   : 43
    <1d4>   DW_AT_decl_column : 14
    <1d5>   DW_AT_prototyped  : 1
    <1d5>   DW_AT_type        : <0x79>
    <1d9>   DW_AT_declaration : 1
    <1d9>   DW_AT_sibling     : <0x1ed>
 <2><1dd>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1de>   DW_AT_type        : <0x79>
 <2><1e2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1e3>   DW_AT_type        : <0x93>
 <2><1e7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1e8>   DW_AT_type        : <0x2e>
 <2><1ec>: Abbrev Number: 0
 <1><1ed>: Abbrev Number: 12 (DW_TAG_subprogram)
    <1ee>   DW_AT_external    : 1
    <1ee>   DW_AT_name        : (indirect string, offset: 0x39): strlen
    <1f2>   DW_AT_decl_file   : 2
    <1f3>   DW_AT_decl_line   : 407
    <1f5>   DW_AT_decl_column : 15
    <1f6>   DW_AT_prototyped  : 1
    <1f6>   DW_AT_type        : <0x2e>
    <1fa>   DW_AT_declaration : 1
    <1fa>   DW_AT_sibling     : <0x204>
 <2><1fe>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1ff>   DW_AT_type        : <0x99>
 <2><203>: Abbrev Number: 0
 <1><204>: Abbrev Number: 12 (DW_TAG_subprogram)
    <205>   DW_AT_external    : 1
    <205>   DW_AT_name        : (indirect string, offset: 0x188): malloc
    <209>   DW_AT_decl_file   : 3
    <20a>   DW_AT_decl_line   : 553
    <20c>   DW_AT_decl_column : 14
    <20d>   DW_AT_prototyped  : 1
    <20d>   DW_AT_type        : <0x79>
    <211>   DW_AT_declaration : 1
    <211>   DW_AT_sibling     : <0x21b>
 <2><215>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <216>   DW_AT_type        : <0x2e>
 <2><21a>: Abbrev Number: 0
 <1><21b>: Abbrev Number: 22 (DW_TAG_subprogram)
    <21c>   DW_AT_external    : 1
    <21c>   DW_AT_name        : (indirect string, offset: 0x40): exit
    <220>   DW_AT_decl_file   : 3
    <221>   DW_AT_decl_line   : 637
    <223>   DW_AT_decl_column : 13
    <224>   DW_AT_prototyped  : 1
    <224>   DW_AT_noreturn    : 1
    <224>   DW_AT_declaration : 1
    <224>   DW_AT_sibling     : <0x22e>
 <2><228>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <229>   DW_AT_type        : <0x41>
 <2><22d>: Abbrev Number: 0
 <1><22e>: Abbrev Number: 12 (DW_TAG_subprogram)
    <22f>   DW_AT_external    : 1
    <22f>   DW_AT_name        : (indirect string, offset: 0x150): printf
    <233>   DW_AT_decl_file   : 4
    <234>   DW_AT_decl_line   : 356
    <236>   DW_AT_decl_column : 12
    <237>   DW_AT_prototyped  : 1
    <237>   DW_AT_type        : <0x41>
    <23b>   DW_AT_declaration : 1
    <23b>   DW_AT_sibling     : <0x246>
 <2><23f>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <240>   DW_AT_type        : <0x99>
 <2><244>: Abbrev Number: 23 (DW_TAG_unspecified_parameters)
 <2><245>: Abbrev Number: 0
 <1><246>: Abbrev Number: 24 (DW_TAG_subprogram)
    <247>   DW_AT_external    : 1
    <247>   DW_AT_name        : (indirect string, offset: 0xef): main
    <24b>   DW_AT_decl_file   : 1
    <24c>   DW_AT_decl_line   : 312
    <24e>   DW_AT_decl_column : 5
    <24f>   DW_AT_type        : <0x41>
    <253>   DW_AT_low_pc      : 0x1b96
    <25b>   DW_AT_high_pc     : 0x47
    <263>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <265>   DW_AT_call_all_tail_calls: 1
    <265>   DW_AT_sibling     : <0x2a6>
